echo "                                            Linux"

# https://www.youtube.com/watch?v=ztOyQXiBin0       Экзамен LPI Linux Essentials

# Linux – это семейство Unix-подобных операционных систем.

# Unix – семейство многозадачных и многопользовательских операционных систем. Unix позволяет одновременно работать сразу с несколькими терминалами, разным людям, при этом каждый из них может выполнять свои действия, что будут использовать ресурсы одного общего ПК.

# Linux - это само ядро, при помощи которого собирают конкретные дистрибутивы(ubuntu, mint итд).

# Linux имеет полностью открытий исходный код, это дает разработчику возможности создать все что-угодно на основе ядра Линукс.

# Дистрибутивы это полноценные оболочки(операционные системы), что были созданы на основе ядра Линукс.
# Большинство дистрибутивов бесплатные.
# Eсть дистрибутивы, что не содержат графический интерфейс

# Узнать на чем основан конкретный дистрибутив можно просто нагуглив карту всех дистрибутивов
# Минт на основе Убунту, а Убунту на основе Дебиан (DEB).

# Андроид также является дистрибутивом, что создан на основе ядра Линукс.

# https://itproger.com/news/kakoy-linux-distributiv-vibrat-top-7  - описание топ дистрибутивов

# https://ubuntu.com/download/desktop       - скачать образ(iso - который можно использовать для установки как на джелезо, например с сд-диска, так и с виртуальной маины) убунту с оф сайта(лучше качать стабильную LTS версию, а не последнюю)

# https://www.linuxmint.com/                - оф сайт Минта. Является самым популярным дистрибутивом. Отличается хорошей стабильностью и простотой работы. В качестве основы используется Ubuntu.


# https://www.youtube.com/watch?v=xBiTsGkQgCo     - Как установить и настроить Ubuntu MATE Linux на virtualbox



echo "                                  Структура файловой системы Linux"

# В виндоус жесткий диск разбивается на отдельные виртуальные диски(C: D: E: итд)

# В Линуксе же есть только 1 диск от корневой директории (/), в которой находятся остальные дериктории, например:
# 1. /home     - содержит домашние директории всех пользователей
# 2. /media    - содержит директории которые выполняют роль как бы виртуальных дисков, флэшек итд, тоесть примерно тоже что и открывается в винде, когда открываешь "мой коипьютер"













#
