echo "                                         Ubuntu установка"

# https://ubuntu.com/download/desktop       - скачать образ(iso - который можно использовать для установки как на железо, например с сд-диска, так и с виртуальной маины) убунту с оф сайта(лучше качать стабильную LTS версию, а не последнюю)

# Убунту создана на основе Дебиан (DEB).


# https://help.ubuntu.com/stable/ubuntu-help/index.html

# 1. Выбираем язык, далее нажимаем "Install Ubuntu/Установить Ubuntu"
# 2. Выберем язык раскладки клавиатуры
# 3. Выберем тип установки и дополнительные программы, если нужны
# 4. Тип установки(как поступить с жеским диском, можно очистить данные перед установкой или еще чтото, на виртуалке очистит диск виртуальной машины). Дадее в доп окне сообщит о разбиении на поддиски(портишены)
# 5. Выберем временную зону
# 6. Создадим администратора: Укажем наше имя, имя машины, имя пользователя, пароль входа и можно поставить галочку чтоб потом спрашивало пароль при входе в систему(123456). Лучше указывать все на латинице
# Далее запускается процесс установки



echo "                                         Ubuntu интерфейс"

# Ubuntu по умолчанию поставляется с окружением рабочего стола Gnome. Но можно установить и другие


# 1. В самом верху есть панель-бар в которой находятся слева-направо:
# "Обзор" - можем при помощи него искать нужные приложения
# "Время и дата" - можно отключить сообщения или наоборот повесить напоминания на какие-то даты
# "Переключение языка"
# "Панель звука, сети, настроек*(1), выключения"
# Так же там появляется меню открытого приложения

# (1) Нужную настройку можно найти поиском(левый верхний угол в меню настроек)
# "Настройка экранов"     - справа в подпункте "Разрешение" можем поменять разрешение(например 1920x1080(16:9))
# "Фон"                   - двойным нажатием по картинке можем изменить картинку главного экрана
# "Внешний вид"           - можем менять визуал в целом
# "Keyboard"              - можно добавить дополнительные языки и настроить горячие клавиши(Keyboard Shortcuts)
# "Remuvable Media"       - меню настроек поведения при вводе диска флэшек итд в зависимости от типа данных на них
# "Users"                 - настройки юзеров(в том числе создание новых)
# "Default Applications"  - настройки программ что будут использоваться по умолчаниюдля(веб - Фаерфокс, для картинок чтото еще итд)
# "About"                 - в самом низу, посмотреть характеристики компьютера и системы


# 2. Боковая панель(слева), содержит иконки в открытых приложений и приложений, что находятся в быстром доступе, по умолчанию это:
# Фаерфокс
# Фаилы - программа для работы с папками в системе
#   Домашняя папка - корневая всего нашего компьютера
#   Other Locations -> Computer   - весь хардиск, тоесть все папки в том числе и системные
# Ubuntu Software(2) - приложение для установки других приложений
# Справка
# Корзина
# Показать приложения - (внизу) кнопка которая открывает меню со всеми приложениями установленными в системе и поиском по ним

# Чтобы добавить приложение в эту панель открываем его, нажимаем правой кнопкой и выбираем "Добавить в избранное"

# Sistem Monitor  - приложение(можно найти в приложениях) аналог диспетчера задач в Винде

# (2) Ubuntu Software - встроенный магазин с графическим приложением для системы Ubuntu. Большинство крупных программ можно скачать при помощи этого приложения, просто выбрав и нажав установить. Программы проходят отбор и безопасны.















#
