echo "                                         Ubuntu установка"

# https://ubuntu.com/download/desktop       - скачать образ(iso - который можно использовать для установки как на джелезо, например с сд-диска, так и с виртуальной маины) убунту с оф сайта(лучше качать стабильную LTS версию, а не последнюю)

# Убунту создана на основе Дебиан (DEB).


# https://help.ubuntu.com/stable/ubuntu-help/index.html

# 1. Выбираем язык, далее нажимаем "Install Ubuntu/Установить Ubuntu"
# 2. Выберем язык раскладки клавиатуры
# 3. Выберем тип установки и дополнительные программы, если нужны
# 4. Тип установки(как поступить с жеским диском, можно очистить данные перед установкой или еще чтото, на виртуалке очистит диск виртуальной машины). Дадее в доп окне сообщит о разбиении на поддиски(портишены)
# 5. Выберем временную зону
# 6. Создадим администратора: Укажем наше имя, имя машины, имя пользователя, пароль входа и можно поставить галочку чтоб потом спрашивало пароль(123456). Лучше указывать все на латинице
# Далее запускается процесс установки



echo "                                         Ubuntu интерфейс"

# 1. В самом верху есть панель-бар в которов находятся слева-направо:
# Обзор - можем при помощи него искать нужные приложения
# Время и дата
# Переключение языка
# Панель звука, сети, настроек, выключения

# Настройки - в правом верхнем углу(панель выключения) там в меню и настройки
# Нужную настройку можно найти поиском(левый верхний угол в меню настроек)
# Пример находим "Настройка экранов" и справа в подпункте "Разрешение" можем поменять разрешение(например 1920x1080(16:9))
# Пример находим "Фон" и двойным нажатием по картинке можем изменить картинку главного экрана
# Пример находим "Внешний вид" можем менять визуал в целом


# 2. Боковая панель(слева), содержит иконки в данный момент открытых приложений и приложений, что находятся в быстром доступе, по умолчанию это:
# Браузер Фаерфокс
# Фаилы - программа для работы с папками в системе(Домашняя папка - корневая всего нашего компьютера)
# Ubuntu Software - приложение для установки других приложений
# Справка
# Корзина
# Показать приложения - (внизу) кнопка которая открывает меню со всеми приложениями установленными в системе и поиском по ним

# Чтобы добавить приложение в эту панель открываем его, нажимаем правой кнопкой и выбираем "Добавить в избранное"

# Ubuntu Software - (по умолчанию вынесен в боковую панель) встроенный магазин с графическим приложением для системы Ubuntu. Большинство крупных программ можно скачать при помощи этого приложения, просто выбрав и нажав установить. Программы проходят отбор и безопасны(?). Но он может не всегда содержать искомую программу, альтернатива менеджер apt-get и утилита dpkg

# Горячие клавиши настроить     - например для смены языка можно настроить в "Настройки" -> "Комбинации клавиш" - "Переключиться на следующий источник ввода"















#
