echo "                                         Горячие клавиши"

# Для вставки и копирования текста в том числе и в терминале можно использовать
# Ctrl + Shift + C              - копировать
# Ctrl + Shift + V              - вставить

# Return                        - аналог Enter(в виртуалке с винды собственно и используется Enter)

# Ctrl + Alt + T                - открыть терминал

# Ctrl + H                      - показать/скрыть скрытые фаилы

# win + пробел                  - для смены языка


# Горячие клавиши Ubuntu настроить     - например для смены языка можно настроить в "Настройки" -> "Комбинации клавиш" - "Переключиться на следующий источник ввода"
