echo "                                         Горячие клавиши"

# Настроить недостающие хоткеи:
# https://stackoverflow.com/questions/6205157/how-to-set-keyboard-shortcuts-to-jump-to-beginning-end-of-line

# Горячие клавиши Ubuntu настроить     - например для смены языка можно настроить в "Настройки" -> "Комбинации клавиш" - "Переключиться на следующий источник ввода"


# Для вставки и копирования текста в том числе и в терминале можно использовать
# Ctrl + Shift + C              - копировать
# Ctrl + Shift + V              - вставить

# Return                        - аналог Enter(в виртуалке с винды собственно и используется Enter)

# Ctrl + H                      - показать/скрыть скрытые фаилы

# win + пробел                  - для смены языка



echo "                                         Консольный режим"

# Любой дистрибутив можно переключить в консольный режим отключив графическую оболочку
# Ctrl + Alt + F3             - переключиться в консольный режим отключив графическую оболочку(спросит логин и пароль)
# Ctrl + Alt + [F3|F4|F5|F6]  - альтернативные сессии консольного режима(можно переключаться туда-сюда)
# ctrl + Alt + F2             - выйти из консольного режима на экран логина
# Ctrl + Alt + F1             - выйти из консольного режима на рабочий стол(так же может войти в консольный режим но по другому ?)



echo "                                             Терминал"

# Ctrl + Alt + T   - открыть терминал, так же можно зайти через меню приложений или обзор на верхней панели


# Tab               - вместо полного введения названия команды, файла или папки можно ввести начальные символы и нажать tab, а терминал дополнит остальную часть названия или предложит альтернативы, если вариантов больше одного


# Ctrl + L                              - очистить терминал, прокрутив их вверх, в отличие от команды clear не удаляет записи

# Ctrl + стрелка(влево или вправо)      - переходить стрелками не по символу а по слову например
# Ctrl + A                              - перейти в начало строки
# Ctrl + E                              - перейти в конец строки

# Ctrl + w                              - (в конце слова) удалить слово целиком в терминале
# Ctrl + u                              - удалить строку

# Ctrl + С                              - прервать процесс

# Ctrl + Z                              - остановить процесс например выполним команду:
# $ ping google.com
# Нажимаем Ctrl + Z, процесс ставится на паузу
# Далее можем выполнять любые команды
# $ fg                                  - возобновляем процесс что был на паузе















#
