echo "                                         Bash скрипты"

# Bash скрипт – файл, что содержит список команд для выполнения в ОС Линукс. При помощи Bash скрипта вы можете выполнять управление вашей операционной системой. Сам же Bash Shell является усовершенствованной вариацией командного терминала.

# $ bash --version                 - посмотреть версию GNU Bash


# Для создания скрипта можно использовать любой текстовый редактор. Например nano

# В скриптах можно описывать любые команды, терминала. При запуске файла все команды будут выполнены друг за другом в терминале вашего компьютера. Помимо стандартных команд можено создавать переменные, получать данные от пользователя, указывать передаваемые параметры и создавать условия, циклы, функции.

# Расширение для баш скрипта - «.sh».

# $ bash script.sh                 - выполнить баш скрипт














# 
