echo "                                            Linux"

# https://www.youtube.com/watch?v=ztOyQXiBin0       Экзамен LPI Linux Essentials

# https://itproger.com/news/kakoy-linux-distributiv-vibrat-top-7  - описание популярных дистрибутивов

# Linux – это семейство Unix-подобных операционных систем.

# Unix – семейство многозадачных и многопользовательских операционных систем. Unix позволяет одновременно работать сразу с несколькими терминалами, разным людям, при этом каждый из них может выполнять свои действия, что будут использовать ресурсы одного общего ПК.

# Linux - это само ядро, при помощи которого собирают конкретные дистрибутивы(Ubuntu, Mint итд).

# Linux имеет полностью открытий исходный код, это дает разработчику возможности создать все что-угодно на основе ядра Линукс.

# Дистрибутивы это полноценные оболочки(операционные системы), что были созданы на основе ядра Линукс.
# Большинство дистрибутивов бесплатные.
# Eсть дистрибутивы, что не содержат графический интерфейс

# Узнать на чем основан конкретный дистрибутив можно просто нагуглив карту всех дистрибутивов
# Например Mint на основе Ubuntu, а Ubuntu на основе Debian (DEB).

# Андроид также является дистрибутивом, что создан на основе ядра Линукс.



echo "                                  Структура файловой системы Linux"

# В Виндоус жесткий диск разбивается на отдельные виртуальные диски(C: D: E: итд)

# В Линуксе же есть только 1 диск от корневой директории (/), в которой находятся остальные дериктории, например:
# 1. /home     - содержит домашние директории всех пользователей
# 2. /media    - содержит директории которые выполняют роль как бы виртуальных дисков, флэшек итд, тоесть примерно тоже что и открывается в винде, когда открываешь "мой коипьютер"



echo "                                                Разное"

# Как поставить Far (far2l) на mac/linux:
# https://github.com/elfmz/far2l
# $ apt-get install far2l
# $ rm ~/.config/far2l/font      - чтобы изменить шрифт нужно удалить данный фаил













#
