echo "                                               Mint"

# https://www.linuxmint.com/                - официальный сайт Минта.

# Linux Mint Cinnamon Edition English       - версия что рекомендовал Роман

# Mint - дестрибутив, создан на основе Ubuntu, а Ubuntu на основе Debian (DEB). Является самым популярным дистрибутивом. Отличается хорошей стабильностью и простотой работы.

# — Linux Mint  -  хорош для слабых устройств, установил и забыл, всё работает, а если ещё и на раздел btrfs и программой timeshift пользоваться, то можно делать моментальные снимки системы, на носу выходы Linux Mint 21 Vanessa, на базе убунту 22.04 (уже вышла бета). В идеале использовать пакеты флатпак, и ставить некоторые программы через деб пакеты. Всё работает с коробки и есть автоматическая установка драйверов при надобности.



echo "                                               Разное"

# https://linux.how2shout.com/2-ways-to-install-docker-engine-on-linux-mint/     - установка докер на линукс минт















#
