echo "                                               Mint"

# https://www.linuxmint.com/                - официальный сайт Минта.

# Linux Mint Cinnamon Edition English       - версия что рекомендовал Роман

# Mint - дестрибутив, создан на основе Ubuntu, а Ubuntu на основе Debian (DEB). Является самым популярным дистрибутивом. Отличается хорошей стабильностью и простотой работы.

# Почему нужен именно английский Линукс - если возникает ошибка, то легче гуглится, а разных ошибок будет очень много за время обучения и карьеры, плюс быстрее они решаются, т.к. на английском инфы больше



echo "                                               Разное"

# https://linux.how2shout.com/2-ways-to-install-docker-engine-on-linux-mint/     - установка докер на линукс минт















#
