echo "                                               Gnome"

# https://help.ubuntu.com/stable/ubuntu-help/index.html

# Gnome — это бесплатная и полностью свободная среда рабочего стола для операционных систем на основе UNIX.

# gnome-look.org   - тут можно скачать темы, тоесть весь внешний вид системы (как их установить описано в их документации там же)
# https://www.youtube.com/watch?v=Nn5jaVjRUgY   (12-20+)


# C окружением рабочего стола Gnome поставляется дистрибутивы: Ubuntu.



echo "                                                 GTK"

# GTK - это набор библиотек для отрисовки графического интерфейса, он написан на Си и используется в окружениях рабочего стола для Linux, напримсер в средах рабочего стола Gnome, Xfce, Cinnamon, Mate. (Но Kde plasma уже используется QT. Который по получше и современнее. Плюс он поддерживает ещё и Android)

# Проверить версию библиотеки GTK в терминале:
# $ dpkg -s libgtk-3-0 | grep '^Version'                    #=> Version: 3.24.20-0ubuntu1.2
# dpkg        -  обращаемся к програмному обеспечению
# libgtk-3-0  -  библиотека GTK версии 3-0















#
